## ANOVA (Analysis of Variance)

**Use:**  
- To compare means of **3 or more groups**.  
- Tests if group means are significantly different.  

**Test statistic:**

$$
F = \frac{MS_{between}}{MS_{within}}
$$

where:  

$$
MS_{between} = \frac{SS_{between}}{df_{between}}, \quad 
MS_{within} = \frac{SS_{within}}{df_{within}}
$$

**Degrees of freedom:**  

$$
df_{between} = k - 1, \quad df_{within} = N - k
$$

where \( k \) = number of groups, \( N \) = total observations.  

**Distribution:**  
- Follows an F-distribution.

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
from scipy.stats import f_oneway

In [19]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [20]:
# As data is not clean (have null values), so we can't perform anova test and will have to drop or fill them
df = df[['age', 'pclass']].dropna()

In [21]:
df['pclass'].unique()

array([3, 1, 2], dtype=int64)

In [22]:
class_1 = df[df['pclass'] == 1]['age']
class_2 = df[df['pclass'] == 2]['age']
class_3 = df[df['pclass'] == 3]['age']

In [23]:
f_stats, p_value = f_oneway(class_1, class_2, class_3)

In [24]:
f_stats

57.443484340676214

In [25]:
p_value

7.487984171959904e-24

In [26]:
alpha = 0.05
if p_value < alpha:
    print("I will reject the null hypothesis")
else:
    print("I will accept the null hypothesis")

I will reject the null hypothesis

## **Created By:** *Hafiz Muhammad Talal*